Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hpdma.h
/*
; stm32V873_hpdma.
; ================

; SPDX-License-Identifier: MIT

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     stm32V873_hpdma equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// HPDMA address definitions
// -------------------------

typedef struct {
    volatile    uint32_t    SECCFGR;
    volatile    uint32_t    PRIVCFGR;
    volatile    uint32_t    RCFGLOCKR;
    volatile    uint32_t    MISR;
    volatile    uint32_t    SMISR;
    volatile    uint32_t    RESERVED0[15];
    volatile    uint32_t    C0LBAR;
    volatile    uint32_t    RESERVED1[2];
    volatile    uint32_t    C0FCR;
    volatile    uint32_t    C0SR;
    volatile    uint32_t    C0CR;
    volatile    uint32_t    RESERVED2[10];
    volatile    uint32_t    C0TR1;
    volatile    uint32_t    C0TR2;
    volatile    uint32_t    C0BR1;
    volatile    uint32_t    C0SAR;
    volatile    uint32_t    C0DAR;
    volatile    uint32_t    RESERVED3[10];
    volatile    uint32_t    C0LLR;
    volatile    uint32_t    C1LBAR;
    volatile    uint32_t    RESERVED4[2];
    volatile    uint32_t    C1FCR;
    volatile    uint32_t    C1SR;
    volatile    uint32_t    C1CR;
    volatile    uint32_t    RESERVED5[10];
    volatile    uint32_t    C1TR1;
    volatile    uint32_t    C1TR2;
    volatile    uint32_t    C1BR1;
    volatile    uint32_t    C1SAR;
    volatile    uint32_t    C1DAR;
    volatile    uint32_t    RESERVED6[10];
    volatile    uint32_t    C1LLR;
    volatile    uint32_t    C2LBAR;
    volatile    uint32_t    RESERVED7[2];
    volatile    uint32_t    C2FCR;
    volatile    uint32_t    C2SR;
    volatile    uint32_t    C2CR;
    volatile    uint32_t    RESERVED8[10];
    volatile    uint32_t    C2TR1;
    volatile    uint32_t    C2TR2;
    volatile    uint32_t    C2BR1;
    volatile    uint32_t    C2SAR;
    volatile    uint32_t    C2DAR;
    volatile    uint32_t    RESERVED9[10];
    volatile    uint32_t    C2LLR;
    volatile    uint32_t    C3LBAR;
    volatile    uint32_t    RESERVED10[2];
    volatile    uint32_t    C3FCR;
    volatile    uint32_t    C3SR;
    volatile    uint32_t    C3CR;
    volatile    uint32_t    RESERVED11[10];
    volatile    uint32_t    C3TR1;
    volatile    uint32_t    C3TR2;
    volatile    uint32_t    C3BR1;
    volatile    uint32_t    C3SAR;
    volatile    uint32_t    C3DAR;
    volatile    uint32_t    RESERVED12[10];
    volatile    uint32_t    C3LLR;
    volatile    uint32_t    C4LBAR;
    volatile    uint32_t    RESERVED13[2];
    volatile    uint32_t    C4FCR;
    volatile    uint32_t    C4SR;
    volatile    uint32_t    C4CR;
    volatile    uint32_t    RESERVED14[10];
    volatile    uint32_t    C4TR1;
    volatile    uint32_t    C4TR2;
    volatile    uint32_t    C4BR1;
    volatile    uint32_t    C4SAR;
    volatile    uint32_t    C4DAR;
    volatile    uint32_t    RESERVED15[10];
    volatile    uint32_t    C4LLR;
    volatile    uint32_t    C5LBAR;
    volatile    uint32_t    RESERVED16[2];
    volatile    uint32_t    C5FCR;
    volatile    uint32_t    C5SR;
    volatile    uint32_t    C5CR;
    volatile    uint32_t    RESERVED17[10];
    volatile    uint32_t    C5TR1;
    volatile    uint32_t    C5TR2;
    volatile    uint32_t    C5BR1;
    volatile    uint32_t    C5SAR;
    volatile    uint32_t    C5DAR;
    volatile    uint32_t    RESERVED18[10];
    volatile    uint32_t    C5LLR;
    volatile    uint32_t    C6LBAR;
    volatile    uint32_t    RESERVED19[2];
    volatile    uint32_t    C6FCR;
    volatile    uint32_t    C6SR;
    volatile    uint32_t    C6CR;
    volatile    uint32_t    RESERVED20[10];
    volatile    uint32_t    C6TR1;
    volatile    uint32_t    C6TR2;
    volatile    uint32_t    C6BR1;
    volatile    uint32_t    C6SAR;
    volatile    uint32_t    C6DAR;
    volatile    uint32_t    RESERVED21[10];
    volatile    uint32_t    C6LLR;
    volatile    uint32_t    C7LBAR;
    volatile    uint32_t    RESERVED22[2];
    volatile    uint32_t    C7FCR;
    volatile    uint32_t    C7SR;
    volatile    uint32_t    C7CR;
    volatile    uint32_t    RESERVED23[10];
    volatile    uint32_t    C7TR1;
    volatile    uint32_t    C7TR2;
    volatile    uint32_t    C7BR1;
    volatile    uint32_t    C7SAR;
    volatile    uint32_t    C7DAR;
    volatile    uint32_t    RESERVED24[10];
    volatile    uint32_t    C7LLR;
    volatile    uint32_t    C8LBAR;
    volatile    uint32_t    RESERVED25[2];
    volatile    uint32_t    C8FCR;
    volatile    uint32_t    C8SR;
    volatile    uint32_t    C8CR;
    volatile    uint32_t    RESERVED26[10];
    volatile    uint32_t    C8TR1;
    volatile    uint32_t    C8TR2;
    volatile    uint32_t    C8BR1;
    volatile    uint32_t    C8SAR;
    volatile    uint32_t    C8DAR;
    volatile    uint32_t    RESERVED27[10];
    volatile    uint32_t    C8LLR;
    volatile    uint32_t    C9LBAR;
    volatile    uint32_t    RESERVED28[2];
    volatile    uint32_t    C9FCR;
    volatile    uint32_t    C9SR;
    volatile    uint32_t    C9CR;
    volatile    uint32_t    RESERVED29[10];
    volatile    uint32_t    C9TR1;
    volatile    uint32_t    C9TR2;
    volatile    uint32_t    C9BR1;
    volatile    uint32_t    C9SAR;
    volatile    uint32_t    C9DAR;
    volatile    uint32_t    RESERVED30[10];
    volatile    uint32_t    C9LLR;
    volatile    uint32_t    C10LBAR;
    volatile    uint32_t    RESERVED31[2];
    volatile    uint32_t    C10FCR;
    volatile    uint32_t    C10SR;
    volatile    uint32_t    C10CR;
    volatile    uint32_t    RESERVED32[10];
    volatile    uint32_t    C10TR1;
    volatile    uint32_t    C10TR2;
    volatile    uint32_t    C10BR1;
    volatile    uint32_t    C10SAR;
    volatile    uint32_t    C10DAR;
    volatile    uint32_t    RESERVED33[10];
    volatile    uint32_t    C10LLR;
    volatile    uint32_t    C11LBAR;
    volatile    uint32_t    RESERVED34[2];
    volatile    uint32_t    C11FCR;
    volatile    uint32_t    C11SR;
    volatile    uint32_t    C11CR;
    volatile    uint32_t    RESERVED35[10];
    volatile    uint32_t    C11TR1;
    volatile    uint32_t    C11TR2;
    volatile    uint32_t    C11BR1;
    volatile    uint32_t    C11SAR;
    volatile    uint32_t    C11DAR;
    volatile    uint32_t    RESERVED36[10];
    volatile    uint32_t    C11LLR;
    volatile    uint32_t    C12LBAR;
    volatile    uint32_t    RESERVED37[2];
    volatile    uint32_t    C12FCR;
    volatile    uint32_t    C12SR;
    volatile    uint32_t    C12CR;
    volatile    uint32_t    RESERVED38[10];
    volatile    uint32_t    C12TR1;
    volatile    uint32_t    C12TR2;
    volatile    uint32_t    C12BR1;
    volatile    uint32_t    C12SAR;
    volatile    uint32_t    C12DAR;
    volatile    uint32_t    C12TR3;
    volatile    uint32_t    C12BR2;
    volatile    uint32_t    RESERVED39[8];
    volatile    uint32_t    C12LLR;
    volatile    uint32_t    C13LBAR;
    volatile    uint32_t    RESERVED40[2];
    volatile    uint32_t    C13FCR;
    volatile    uint32_t    C13SR;
    volatile    uint32_t    C13CR;
    volatile    uint32_t    RESERVED41[10];
    volatile    uint32_t    C13TR1;
    volatile    uint32_t    C13TR2;
    volatile    uint32_t    C13BR1;
    volatile    uint32_t    C13SAR;
    volatile    uint32_t    C13DAR;
    volatile    uint32_t    C13TR3;
    volatile    uint32_t    C13BR2;
    volatile    uint32_t    RESERVED42[8];
    volatile    uint32_t    C13LLR;
    volatile    uint32_t    C14LBAR;
    volatile    uint32_t    RESERVED43[2];
    volatile    uint32_t    C14FCR;
    volatile    uint32_t    C14SR;
    volatile    uint32_t    C14CR;
    volatile    uint32_t    RESERVED44[10];
    volatile    uint32_t    C14TR1;
    volatile    uint32_t    C14TR2;
    volatile    uint32_t    C14BR1;
    volatile    uint32_t    C14SAR;
    volatile    uint32_t    C14DAR;
    volatile    uint32_t    C14TR3;
    volatile    uint32_t    C14BR2;
    volatile    uint32_t    RESERVED45[8];
    volatile    uint32_t    C14LLR;
    volatile    uint32_t    C15LBAR;
    volatile    uint32_t    RESERVED46[2];
    volatile    uint32_t    C15FCR;
    volatile    uint32_t    C15SR;
    volatile    uint32_t    C15CR;
    volatile    uint32_t    RESERVED47[10];
    volatile    uint32_t    C15TR1;
    volatile    uint32_t    C15TR2;
    volatile    uint32_t    C15BR1;
    volatile    uint32_t    C15SAR;
    volatile    uint32_t    C15DAR;
    volatile    uint32_t    C15TR3;
    volatile    uint32_t    C15BR2;
    volatile    uint32_t    RESERVED48[8];
    volatile    uint32_t    C15LLR;
} HPDMA_TypeDef;

#if (defined(__cplusplus))
#define HPDMA_NS    reinterpret_cast<HPDMA_TypeDef *>(0x48020000u)
#define HPDMA_S     reinterpret_cast<HPDMA_TypeDef *>(0x58020000u)

#else
#define HPDMA_NS    ((HPDMA_TypeDef *)0x48020000u)
#define HPDMA_S     ((HPDMA_TypeDef *)0x58020000u)
#endif

