Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hpdma.h
#define HPDMA_C2FCR_TOF_B_0X0           (0x0u<<14)
#define HPDMA_C2FCR_TOF_B_0X1           (0x1u<<14)
#define HPDMA_C2FCR_SUSPF_B_0X0         (0x0u<<13)
#define HPDMA_C2FCR_SUSPF_B_0X1         (0x1u<<13)
#define HPDMA_C2FCR_USEF_B_0X0          (0x0u<<12)
#define HPDMA_C2FCR_USEF_B_0X1          (0x1u<<12)
#define HPDMA_C2FCR_ULEF_B_0X0          (0x0u<<11)
#define HPDMA_C2FCR_ULEF_B_0X1          (0x1u<<11)
#define HPDMA_C2FCR_DTEF_B_0X0          (0x0u<<10)
#define HPDMA_C2FCR_DTEF_B_0X1          (0x1u<<10)
#define HPDMA_C2FCR_HTF_B_0X0           (0x0u<<9)
#define HPDMA_C2FCR_HTF_B_0X1           (0x1u<<9)
#define HPDMA_C2FCR_TCF_B_0X0           (0x0u<<8)
#define HPDMA_C2FCR_TCF_B_0X1           (0x1u<<8)

// C2SR Configuration

#define HPDMA_C2SR_FIFOL                (0x1FFu<<16)
#define HPDMA_C2SR_FIFOL_0              (0x1u<<16)
#define HPDMA_C2SR_TOF                  (0x1u<<14)
#define HPDMA_C2SR_SUSPF                (0x1u<<13)
#define HPDMA_C2SR_USEF                 (0x1u<<12)
#define HPDMA_C2SR_ULEF                 (0x1u<<11)
#define HPDMA_C2SR_DTEF                 (0x1u<<10)
#define HPDMA_C2SR_HTF                  (0x1u<<9)
#define HPDMA_C2SR_TCF                  (0x1u<<8)
#define HPDMA_C2SR_IDLEF                (0x1u<<0)

#define HPDMA_C2SR_TOF_B_0X0            (0x0u<<14)
#define HPDMA_C2SR_TOF_B_0X1            (0x1u<<14)
#define HPDMA_C2SR_SUSPF_B_0X0          (0x0u<<13)
#define HPDMA_C2SR_SUSPF_B_0X1          (0x1u<<13)
#define HPDMA_C2SR_USEF_B_0X0           (0x0u<<12)
#define HPDMA_C2SR_USEF_B_0X1           (0x1u<<12)
#define HPDMA_C2SR_ULEF_B_0X0           (0x0u<<11)
#define HPDMA_C2SR_ULEF_B_0X1           (0x1u<<11)
#define HPDMA_C2SR_DTEF_B_0X0           (0x0u<<10)
#define HPDMA_C2SR_DTEF_B_0X1           (0x1u<<10)
#define HPDMA_C2SR_HTF_B_0X0            (0x0u<<9)
#define HPDMA_C2SR_HTF_B_0X1            (0x1u<<9)
#define HPDMA_C2SR_TCF_B_0X0            (0x0u<<8)
#define HPDMA_C2SR_TCF_B_0X1            (0x1u<<8)
#define HPDMA_C2SR_IDLEF_B_0X0          (0x0u<<0)
#define HPDMA_C2SR_IDLEF_B_0X1          (0x1u<<0)

// C2CR Configuration

#define HPDMA_C2CR_PRIO                 (0x3u<<22)
#define HPDMA_C2CR_PRIO_0               (0x1u<<22)
#define HPDMA_C2CR_LAP                  (0x1u<<17)
#define HPDMA_C2CR_LSM                  (0x1u<<16)
#define HPDMA_C2CR_TOIE                 (0x1u<<14)
#define HPDMA_C2CR_SUSPIE               (0x1u<<13)
#define HPDMA_C2CR_USEIE                (0x1u<<12)
#define HPDMA_C2CR_ULEIE                (0x1u<<11)
#define HPDMA_C2CR_DTEIE                (0x1u<<10)
#define HPDMA_C2CR_HTIE                 (0x1u<<9)
#define HPDMA_C2CR_TCIE                 (0x1u<<8)
#define HPDMA_C2CR_SUSP                 (0x1u<<2)
#define HPDMA_C2CR_RESET                (0x1u<<1)
#define HPDMA_C2CR_EN                   (0x1u<<0)

#define HPDMA_C2CR_PRIO_B_0X0           (0x0u<<22)
#define HPDMA_C2CR_PRIO_B_0X1           (0x1u<<22)
#define HPDMA_C2CR_PRIO_B_0X2           (0x2u<<22)
#define HPDMA_C2CR_PRIO_B_0X3           (0x3u<<22)
#define HPDMA_C2CR_LAP_B_0X0            (0x0u<<17)
#define HPDMA_C2CR_LAP_B_0X1            (0x1u<<17)
#define HPDMA_C2CR_LSM_B_0X0            (0x0u<<16)
#define HPDMA_C2CR_LSM_B_0X1            (0x1u<<16)
#define HPDMA_C2CR_TOIE_B_0X0           (0x0u<<14)
#define HPDMA_C2CR_TOIE_B_0X1           (0x1u<<14)
#define HPDMA_C2CR_SUSPIE_B_0X0         (0x0u<<13)
#define HPDMA_C2CR_SUSPIE_B_0X1         (0x1u<<13)
#define HPDMA_C2CR_USEIE_B_0X0          (0x0u<<12)
#define HPDMA_C2CR_USEIE_B_0X1          (0x1u<<12)
#define HPDMA_C2CR_ULEIE_B_0X0          (0x0u<<11)
#define HPDMA_C2CR_ULEIE_B_0X1          (0x1u<<11)
#define HPDMA_C2CR_DTEIE_B_0X0          (0x0u<<10)
#define HPDMA_C2CR_DTEIE_B_0X1          (0x1u<<10)
#define HPDMA_C2CR_HTIE_B_0X0           (0x0u<<9)
#define HPDMA_C2CR_HTIE_B_0X1           (0x1u<<9)
#define HPDMA_C2CR_TCIE_B_0X0           (0x0u<<8)
#define HPDMA_C2CR_TCIE_B_0X1           (0x1u<<8)
#define HPDMA_C2CR_SUSP_B_0X0           (0x0u<<2)
#define HPDMA_C2CR_SUSP_B_0X1           (0x1u<<2)
#define HPDMA_C2CR_RESET_B_0X0          (0x0u<<1)
#define HPDMA_C2CR_RESET_B_0X1          (0x1u<<1)
#define HPDMA_C2CR_EN_B_0X0             (0x0u<<0)
#define HPDMA_C2CR_EN_B_0X1             (0x1u<<0)

// C2TR1 Configuration

#define HPDMA_C2TR1_DSEC                (0x1u<<31)
#define HPDMA_C2TR1_DAP                 (0x1u<<30)
#define HPDMA_C2TR1_DWX                 (0x1u<<28)
#define HPDMA_C2TR1_DHX                 (0x1u<<27)
#define HPDMA_C2TR1_DBX                 (0x1u<<26)
#define HPDMA_C2TR1_DBL_1               (0x3Fu<<20)
#define HPDMA_C2TR1_DBL_1_0             (0x1u<<20)
#define HPDMA_C2TR1_DINC                (0x1u<<19)
#define HPDMA_C2TR1_DDW_LOG2            (0x3u<<16)
#define HPDMA_C2TR1_DDW_LOG2_0          (0x1u<<16)
#define HPDMA_C2TR1_SSEC                (0x1u<<15)
#define HPDMA_C2TR1_SAP                 (0x1u<<14)
#define HPDMA_C2TR1_SBX                 (0x1u<<13)
#define HPDMA_C2TR1_PAM                 (0x3u<<11)
#define HPDMA_C2TR1_PAM_0               (0x1u<<11)
#define HPDMA_C2TR1_SBL_1               (0x3Fu<<4)
#define HPDMA_C2TR1_SBL_1_0             (0x1u<<4)
#define HPDMA_C2TR1_SINC                (0x1u<<3)
#define HPDMA_C2TR1_SDW_LOG2            (0x3u<<0)
#define HPDMA_C2TR1_SDW_LOG2_0          (0x1u<<0)

#define HPDMA_C2TR1_DSEC_B_0X0          (0x0u<<31)
#define HPDMA_C2TR1_DSEC_B_0X1          (0x1u<<31)
#define HPDMA_C2TR1_DAP_B_0X0           (0x0u<<30)
#define HPDMA_C2TR1_DAP_B_0X1           (0x1u<<30)
#define HPDMA_C2TR1_DWX_B_0X0           (0x0u<<28)
#define HPDMA_C2TR1_DWX_B_0X1           (0x1u<<28)
#define HPDMA_C2TR1_DHX_B_0X0           (0x0u<<27)
#define HPDMA_C2TR1_DHX_B_0X1           (0x1u<<27)
#define HPDMA_C2TR1_DBX_B_0X0           (0x0u<<26)
#define HPDMA_C2TR1_DBX_B_0X1           (0x1u<<26)
#define HPDMA_C2TR1_DINC_B_0X0          (0x0u<<19)
#define HPDMA_C2TR1_DINC_B_0X1          (0x1u<<19)
#define HPDMA_C2TR1_DDW_LOG2_B_0X0      (0x0u<<16)
#define HPDMA_C2TR1_DDW_LOG2_B_0X1      (0x1u<<16)
#define HPDMA_C2TR1_DDW_LOG2_B_0X2      (0x2u<<16)
#define HPDMA_C2TR1_DDW_LOG2_B_0X3      (0x3u<<16)
#define HPDMA_C2TR1_SSEC_B_0X0          (0x0u<<15)
#define HPDMA_C2TR1_SSEC_B_0X1          (0x1u<<15)
#define HPDMA_C2TR1_SAP_B_0X0           (0x0u<<14)
#define HPDMA_C2TR1_SAP_B_0X1           (0x1u<<14)
#define HPDMA_C2TR1_SBX_B_0X0           (0x0u<<13)
#define HPDMA_C2TR1_SBX_B_0X1           (0x1u<<13)
#define HPDMA_C2TR1_PAM_B_0X0_PAM_1     (0x0u<<11)
#define HPDMA_C2TR1_PAM_B_0X1_PAM_1     (0x1u<<11)
#define HPDMA_C2TR1_PAM_B_0X2_PAM_1     (0x2u<<11)
#define HPDMA_C2TR1_PAM_B_0X3_PAM_1     (0x3u<<11)
#define HPDMA_C2TR1_SINC_B_0X0          (0x0u<<3)
#define HPDMA_C2TR1_SINC_B_0X1          (0x1u<<3)
#define HPDMA_C2TR1_SDW_LOG2_B_0X0      (0x0u<<0)
#define HPDMA_C2TR1_SDW_LOG2_B_0X1      (0x1u<<0)
#define HPDMA_C2TR1_SDW_LOG2_B_0X2      (0x2u<<0)
#define HPDMA_C2TR1_SDW_LOG2_B_0X3      (0x3u<<0)

// C2TR2 Configuration

#define HPDMA_C2TR2_TCEM                (0x3u<<30)
#define HPDMA_C2TR2_TCEM_0              (0x1u<<30)
#define HPDMA_C2TR2_TRIGPOL             (0x3u<<24)
#define HPDMA_C2TR2_TRIGPOL_0           (0x1u<<24)
#define HPDMA_C2TR2_TRIGSEL             (0x7Fu<<16)
#define HPDMA_C2TR2_TRIGSEL_0           (0x1u<<16)
#define HPDMA_C2TR2_TRIGM               (0x3u<<14)
#define HPDMA_C2TR2_TRIGM_0             (0x1u<<14)
#define HPDMA_C2TR2_PFREQ               (0x1u<<12)
#define HPDMA_C2TR2_BREQ                (0x1u<<11)
#define HPDMA_C2TR2_DREQ                (0x1u<<10)
#define HPDMA_C2TR2_SWREQ               (0x1u<<9)
#define HPDMA_C2TR2_REQSEL              (0xFFu<<0)
#define HPDMA_C2TR2_REQSEL_0            (0x1u<<0)

