Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hpdma.h
#define HPDMA_C11TR2_TCEM_B_0X0         (0x0u<<30)
#define HPDMA_C11TR2_TCEM_B_0X1         (0x1u<<30)
#define HPDMA_C11TR2_TCEM_B_0X2         (0x2u<<30)
#define HPDMA_C11TR2_TCEM_B_0X3         (0x3u<<30)
#define HPDMA_C11TR2_TRIGPOL_B_0X0      (0x0u<<24)
#define HPDMA_C11TR2_TRIGPOL_B_0X1      (0x1u<<24)
#define HPDMA_C11TR2_TRIGPOL_B_0X2      (0x2u<<24)
#define HPDMA_C11TR2_TRIGPOL_B_0X3      (0x3u<<24)
#define HPDMA_C11TR2_TRIGM_B_0X0        (0x0u<<14)
#define HPDMA_C11TR2_TRIGM_B_0X1        (0x1u<<14)
#define HPDMA_C11TR2_TRIGM_B_0X2        (0x2u<<14)
#define HPDMA_C11TR2_TRIGM_B_0X3        (0x3u<<14)
#define HPDMA_C11TR2_PFREQ_B_0X0        (0x0u<<12)
#define HPDMA_C11TR2_PFREQ_B_0X1        (0x1u<<12)
#define HPDMA_C11TR2_BREQ_B_0X0         (0x0u<<11)
#define HPDMA_C11TR2_BREQ_B_0X1         (0x1u<<11)
#define HPDMA_C11TR2_DREQ_B_0X0         (0x0u<<10)
#define HPDMA_C11TR2_DREQ_B_0X1         (0x1u<<10)
#define HPDMA_C11TR2_SWREQ_B_0X0        (0x0u<<9)
#define HPDMA_C11TR2_SWREQ_B_0X1        (0x1u<<9)

// C11BR1 Configuration

#define HPDMA_C11BR1_BNDT               (0xFFFFu<<0)
#define HPDMA_C11BR1_BNDT_0             (0x1u<<0)

// C11SAR Configuration

#define HPDMA_C11SAR_SA                 (0xFFFFFFFFu<<0)
#define HPDMA_C11SAR_SA_0               (0x1u<<0)

// C11DAR Configuration

#define HPDMA_C11DAR_DA                 (0xFFFFFFFFu<<0)
#define HPDMA_C11DAR_DA_0               (0x1u<<0)

// C11LLR Configuration

#define HPDMA_C11LLR_UT1                (0x1u<<31)
#define HPDMA_C11LLR_UT2                (0x1u<<30)
#define HPDMA_C11LLR_UB1                (0x1u<<29)
#define HPDMA_C11LLR_USA                (0x1u<<28)
#define HPDMA_C11LLR_UDA                (0x1u<<27)
#define HPDMA_C11LLR_ULL                (0x1u<<16)
#define HPDMA_C11LLR_LA                 (0x3FFFu<<2)
#define HPDMA_C11LLR_LA_0               (0x1u<<2)

#define HPDMA_C11LLR_UT1_B_0X0          (0x0u<<31)
#define HPDMA_C11LLR_UT1_B_0X1          (0x1u<<31)
#define HPDMA_C11LLR_UT2_B_0X0          (0x0u<<30)
#define HPDMA_C11LLR_UT2_B_0X1          (0x1u<<30)
#define HPDMA_C11LLR_UB1_B_0X0          (0x0u<<29)
#define HPDMA_C11LLR_UB1_B_0X1          (0x1u<<29)
#define HPDMA_C11LLR_USA_B_0X0          (0x0u<<28)
#define HPDMA_C11LLR_USA_B_0X1          (0x1u<<28)
#define HPDMA_C11LLR_UDA_B_0X0          (0x0u<<27)
#define HPDMA_C11LLR_UDA_B_0X1          (0x1u<<27)
#define HPDMA_C11LLR_ULL_B_0X0          (0x0u<<16)
#define HPDMA_C11LLR_ULL_B_0X1          (0x1u<<16)

// C12LBAR Configuration

#define HPDMA_C12LBAR_LBA               (0xFFFFu<<16)
#define HPDMA_C12LBAR_LBA_0             (0x1u<<16)

// C12FCR Configuration

#define HPDMA_C12FCR_TOF                (0x1u<<14)
#define HPDMA_C12FCR_SUSPF              (0x1u<<13)
#define HPDMA_C12FCR_USEF               (0x1u<<12)
#define HPDMA_C12FCR_ULEF               (0x1u<<11)
#define HPDMA_C12FCR_DTEF               (0x1u<<10)
#define HPDMA_C12FCR_HTF                (0x1u<<9)
#define HPDMA_C12FCR_TCF                (0x1u<<8)

#define HPDMA_C12FCR_TOF_B_0X0          (0x0u<<14)
#define HPDMA_C12FCR_TOF_B_0X1          (0x1u<<14)
#define HPDMA_C12FCR_SUSPF_B_0X0        (0x0u<<13)
#define HPDMA_C12FCR_SUSPF_B_0X1        (0x1u<<13)
#define HPDMA_C12FCR_USEF_B_0X0         (0x0u<<12)
#define HPDMA_C12FCR_USEF_B_0X1         (0x1u<<12)
#define HPDMA_C12FCR_ULEF_B_0X0         (0x0u<<11)
#define HPDMA_C12FCR_ULEF_B_0X1         (0x1u<<11)
#define HPDMA_C12FCR_DTEF_B_0X0         (0x0u<<10)
#define HPDMA_C12FCR_DTEF_B_0X1         (0x1u<<10)
#define HPDMA_C12FCR_HTF_B_0X0          (0x0u<<9)
#define HPDMA_C12FCR_HTF_B_0X1          (0x1u<<9)
#define HPDMA_C12FCR_TCF_B_0X0          (0x0u<<8)
#define HPDMA_C12FCR_TCF_B_0X1          (0x1u<<8)

// C12SR Configuration

#define HPDMA_C12SR_FIFOL               (0x1FFu<<16)
#define HPDMA_C12SR_FIFOL_0             (0x1u<<16)
#define HPDMA_C12SR_TOF                 (0x1u<<14)
#define HPDMA_C12SR_SUSPF               (0x1u<<13)
#define HPDMA_C12SR_USEF                (0x1u<<12)
#define HPDMA_C12SR_ULEF                (0x1u<<11)
#define HPDMA_C12SR_DTEF                (0x1u<<10)
#define HPDMA_C12SR_HTF                 (0x1u<<9)
#define HPDMA_C12SR_TCF                 (0x1u<<8)
#define HPDMA_C12SR_IDLEF               (0x1u<<0)

#define HPDMA_C12SR_TOF_B_0X0           (0x0u<<14)
#define HPDMA_C12SR_TOF_B_0X1           (0x1u<<14)
#define HPDMA_C12SR_SUSPF_B_0X0         (0x0u<<13)
#define HPDMA_C12SR_SUSPF_B_0X1         (0x1u<<13)
#define HPDMA_C12SR_USEF_B_0X0          (0x0u<<12)
#define HPDMA_C12SR_USEF_B_0X1          (0x1u<<12)
#define HPDMA_C12SR_ULEF_B_0X0          (0x0u<<11)
#define HPDMA_C12SR_ULEF_B_0X1          (0x1u<<11)
#define HPDMA_C12SR_DTEF_B_0X0          (0x0u<<10)
#define HPDMA_C12SR_DTEF_B_0X1          (0x1u<<10)
#define HPDMA_C12SR_HTF_B_0X0           (0x0u<<9)
#define HPDMA_C12SR_HTF_B_0X1           (0x1u<<9)
#define HPDMA_C12SR_TCF_B_0X0           (0x0u<<8)
#define HPDMA_C12SR_TCF_B_0X1           (0x1u<<8)
#define HPDMA_C12SR_IDLEF_B_0X0         (0x0u<<0)
#define HPDMA_C12SR_IDLEF_B_0X1         (0x1u<<0)

// C12CR Configuration

#define HPDMA_C12CR_PRIO                (0x3u<<22)
#define HPDMA_C12CR_PRIO_0              (0x1u<<22)
#define HPDMA_C12CR_LAP                 (0x1u<<17)
#define HPDMA_C12CR_LSM                 (0x1u<<16)
#define HPDMA_C12CR_TOIE                (0x1u<<14)
#define HPDMA_C12CR_SUSPIE              (0x1u<<13)
#define HPDMA_C12CR_USEIE               (0x1u<<12)
#define HPDMA_C12CR_ULEIE               (0x1u<<11)
#define HPDMA_C12CR_DTEIE               (0x1u<<10)
#define HPDMA_C12CR_HTIE                (0x1u<<9)
#define HPDMA_C12CR_TCIE                (0x1u<<8)
#define HPDMA_C12CR_SUSP                (0x1u<<2)
#define HPDMA_C12CR_RESET               (0x1u<<1)
#define HPDMA_C12CR_EN                  (0x1u<<0)

#define HPDMA_C12CR_PRIO_B_0X0          (0x0u<<22)
#define HPDMA_C12CR_PRIO_B_0X1          (0x1u<<22)
#define HPDMA_C12CR_PRIO_B_0X2          (0x2u<<22)
#define HPDMA_C12CR_PRIO_B_0X3          (0x3u<<22)
#define HPDMA_C12CR_LAP_B_0X0           (0x0u<<17)
#define HPDMA_C12CR_LAP_B_0X1           (0x1u<<17)
#define HPDMA_C12CR_LSM_B_0X0           (0x0u<<16)
#define HPDMA_C12CR_LSM_B_0X1           (0x1u<<16)
#define HPDMA_C12CR_TOIE_B_0X0          (0x0u<<14)
#define HPDMA_C12CR_TOIE_B_0X1          (0x1u<<14)
#define HPDMA_C12CR_SUSPIE_B_0X0        (0x0u<<13)
#define HPDMA_C12CR_SUSPIE_B_0X1        (0x1u<<13)
#define HPDMA_C12CR_USEIE_B_0X0         (0x0u<<12)
#define HPDMA_C12CR_USEIE_B_0X1         (0x1u<<12)
#define HPDMA_C12CR_ULEIE_B_0X0         (0x0u<<11)
#define HPDMA_C12CR_ULEIE_B_0X1         (0x1u<<11)
#define HPDMA_C12CR_DTEIE_B_0X0         (0x0u<<10)
#define HPDMA_C12CR_DTEIE_B_0X1         (0x1u<<10)
#define HPDMA_C12CR_HTIE_B_0X0          (0x0u<<9)
#define HPDMA_C12CR_HTIE_B_0X1          (0x1u<<9)
#define HPDMA_C12CR_TCIE_B_0X0          (0x0u<<8)
#define HPDMA_C12CR_TCIE_B_0X1          (0x1u<<8)
#define HPDMA_C12CR_SUSP_B_0X0          (0x0u<<2)
#define HPDMA_C12CR_SUSP_B_0X1          (0x1u<<2)
#define HPDMA_C12CR_RESET_B_0X0         (0x0u<<1)
#define HPDMA_C12CR_RESET_B_0X1         (0x1u<<1)
#define HPDMA_C12CR_EN_B_0X0            (0x0u<<0)
#define HPDMA_C12CR_EN_B_0X1            (0x1u<<0)

// C12TR1 Configuration

#define HPDMA_C12TR1_DSEC               (0x1u<<31)
#define HPDMA_C12TR1_DAP                (0x1u<<30)
#define HPDMA_C12TR1_DWX                (0x1u<<28)
#define HPDMA_C12TR1_DHX                (0x1u<<27)
#define HPDMA_C12TR1_DBX                (0x1u<<26)
#define HPDMA_C12TR1_DBL_1              (0x3Fu<<20)
#define HPDMA_C12TR1_DBL_1_0            (0x1u<<20)
#define HPDMA_C12TR1_DINC               (0x1u<<19)
#define HPDMA_C12TR1_DDW_LOG2           (0x3u<<16)
#define HPDMA_C12TR1_DDW_LOG2_0         (0x1u<<16)
#define HPDMA_C12TR1_SSEC               (0x1u<<15)
#define HPDMA_C12TR1_SAP                (0x1u<<14)
#define HPDMA_C12TR1_SBX                (0x1u<<13)
#define HPDMA_C12TR1_PAM                (0x3u<<11)
#define HPDMA_C12TR1_PAM_0              (0x1u<<11)
#define HPDMA_C12TR1_SBL_1              (0x3Fu<<4)
#define HPDMA_C12TR1_SBL_1_0            (0x1u<<4)
#define HPDMA_C12TR1_SINC               (0x1u<<3)
#define HPDMA_C12TR1_SDW_LOG2           (0x3u<<0)
#define HPDMA_C12TR1_SDW_LOG2_0         (0x1u<<0)

