Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hpdma.h
#define HPDMA_C14TR1_DSEC_B_0X0         (0x0u<<31)
#define HPDMA_C14TR1_DSEC_B_0X1         (0x1u<<31)
#define HPDMA_C14TR1_DAP_B_0X0          (0x0u<<30)
#define HPDMA_C14TR1_DAP_B_0X1          (0x1u<<30)
#define HPDMA_C14TR1_DWX_B_0X0          (0x0u<<28)
#define HPDMA_C14TR1_DWX_B_0X1          (0x1u<<28)
#define HPDMA_C14TR1_DHX_B_0X0          (0x0u<<27)
#define HPDMA_C14TR1_DHX_B_0X1          (0x1u<<27)
#define HPDMA_C14TR1_DBX_B_0X0          (0x0u<<26)
#define HPDMA_C14TR1_DBX_B_0X1          (0x1u<<26)
#define HPDMA_C14TR1_DINC_B_0X0         (0x0u<<19)
#define HPDMA_C14TR1_DINC_B_0X1         (0x1u<<19)
#define HPDMA_C14TR1_DDW_LOG2_B_0X0     (0x0u<<16)
#define HPDMA_C14TR1_DDW_LOG2_B_0X1     (0x1u<<16)
#define HPDMA_C14TR1_DDW_LOG2_B_0X2     (0x2u<<16)
#define HPDMA_C14TR1_DDW_LOG2_B_0X3     (0x3u<<16)
#define HPDMA_C14TR1_SSEC_B_0X0         (0x0u<<15)
#define HPDMA_C14TR1_SSEC_B_0X1         (0x1u<<15)
#define HPDMA_C14TR1_SAP_B_0X0          (0x0u<<14)
#define HPDMA_C14TR1_SAP_B_0X1          (0x1u<<14)
#define HPDMA_C14TR1_SBX_B_0X0          (0x0u<<13)
#define HPDMA_C14TR1_SBX_B_0X1          (0x1u<<13)
#define HPDMA_C14TR1_PAM_B_0X0_PAM_1    (0x0u<<11)
#define HPDMA_C14TR1_PAM_B_0X1_PAM_1    (0x1u<<11)
#define HPDMA_C14TR1_PAM_B_0X2_PAM_1    (0x2u<<11)
#define HPDMA_C14TR1_PAM_B_0X3_PAM_1    (0x3u<<11)
#define HPDMA_C14TR1_SINC_B_0X0         (0x0u<<3)
#define HPDMA_C14TR1_SINC_B_0X1         (0x1u<<3)
#define HPDMA_C14TR1_SDW_LOG2_B_0X0     (0x0u<<0)
#define HPDMA_C14TR1_SDW_LOG2_B_0X1     (0x1u<<0)
#define HPDMA_C14TR1_SDW_LOG2_B_0X2     (0x2u<<0)
#define HPDMA_C14TR1_SDW_LOG2_B_0X3     (0x3u<<0)

// C14TR2 Configuration

#define HPDMA_C14TR2_TCEM               (0x3u<<30)
#define HPDMA_C14TR2_TCEM_0             (0x1u<<30)
#define HPDMA_C14TR2_TRIGPOL            (0x3u<<24)
#define HPDMA_C14TR2_TRIGPOL_0          (0x1u<<24)
#define HPDMA_C14TR2_TRIGSEL            (0x7Fu<<16)
#define HPDMA_C14TR2_TRIGSEL_0          (0x1u<<16)
#define HPDMA_C14TR2_TRIGM              (0x3u<<14)
#define HPDMA_C14TR2_TRIGM_0            (0x1u<<14)
#define HPDMA_C14TR2_PFREQ              (0x1u<<12)
#define HPDMA_C14TR2_BREQ               (0x1u<<11)
#define HPDMA_C14TR2_DREQ               (0x1u<<10)
#define HPDMA_C14TR2_SWREQ              (0x1u<<9)
#define HPDMA_C14TR2_REQSEL             (0xFFu<<0)
#define HPDMA_C14TR2_REQSEL_0           (0x1u<<0)

#define HPDMA_C14TR2_TCEM_B_0X0         (0x0u<<30)
#define HPDMA_C14TR2_TCEM_B_0X1         (0x1u<<30)
#define HPDMA_C14TR2_TCEM_B_0X2         (0x2u<<30)
#define HPDMA_C14TR2_TCEM_B_0X3         (0x3u<<30)
#define HPDMA_C14TR2_TRIGPOL_B_0X0      (0x0u<<24)
#define HPDMA_C14TR2_TRIGPOL_B_0X1      (0x1u<<24)
#define HPDMA_C14TR2_TRIGPOL_B_0X2      (0x2u<<24)
#define HPDMA_C14TR2_TRIGPOL_B_0X3      (0x3u<<24)
#define HPDMA_C14TR2_TRIGM_B_0X0        (0x0u<<14)
#define HPDMA_C14TR2_TRIGM_B_0X1        (0x1u<<14)
#define HPDMA_C14TR2_TRIGM_B_0X2        (0x2u<<14)
#define HPDMA_C14TR2_TRIGM_B_0X3        (0x3u<<14)
#define HPDMA_C14TR2_PFREQ_B_0X0        (0x0u<<12)
#define HPDMA_C14TR2_PFREQ_B_0X1        (0x1u<<12)
#define HPDMA_C14TR2_BREQ_B_0X0         (0x0u<<11)
#define HPDMA_C14TR2_BREQ_B_0X1         (0x1u<<11)
#define HPDMA_C14TR2_DREQ_B_0X0         (0x0u<<10)
#define HPDMA_C14TR2_DREQ_B_0X1         (0x1u<<10)
#define HPDMA_C14TR2_SWREQ_B_0X0        (0x0u<<9)
#define HPDMA_C14TR2_SWREQ_B_0X1        (0x1u<<9)

// C14BR1 Configuration

#define HPDMA_C14BR1_BRDDEC             (0x1u<<31)
#define HPDMA_C14BR1_BRSDEC             (0x1u<<30)
#define HPDMA_C14BR1_DDEC               (0x1u<<29)
#define HPDMA_C14BR1_SDEC               (0x1u<<28)
#define HPDMA_C14BR1_BRC                (0x7FFu<<16)
#define HPDMA_C14BR1_BRC_0              (0x1u<<16)
#define HPDMA_C14BR1_BNDT               (0xFFFFu<<0)
#define HPDMA_C14BR1_BNDT_0             (0x1u<<0)

#define HPDMA_C14BR1_BRDDEC_B_0X0       (0x0u<<31)
#define HPDMA_C14BR1_BRDDEC_B_0X1       (0x1u<<31)
#define HPDMA_C14BR1_BRSDEC_B_0X0       (0x0u<<30)
#define HPDMA_C14BR1_BRSDEC_B_0X1       (0x1u<<30)
#define HPDMA_C14BR1_DDEC_B_0X0         (0x0u<<29)
#define HPDMA_C14BR1_DDEC_B_0X1         (0x1u<<29)
#define HPDMA_C14BR1_SDEC_B_0X0         (0x0u<<28)
#define HPDMA_C14BR1_SDEC_B_0X1         (0x1u<<28)

// C14SAR Configuration

#define HPDMA_C14SAR_SA                 (0xFFFFFFFFu<<0)
#define HPDMA_C14SAR_SA_0               (0x1u<<0)

// C14DAR Configuration

#define HPDMA_C14DAR_DA                 (0xFFFFFFFFu<<0)
#define HPDMA_C14DAR_DA_0               (0x1u<<0)

// C14TR3 Configuration

#define HPDMA_C14TR3_DAO                (0x1FFFu<<16)
#define HPDMA_C14TR3_DAO_0              (0x1u<<16)
#define HPDMA_C14TR3_SAO                (0x1FFFu<<0)
#define HPDMA_C14TR3_SAO_0              (0x1u<<0)

// C14BR2 Configuration

#define HPDMA_C14BR2_BRDAO              (0xFFFFu<<16)
#define HPDMA_C14BR2_BRDAO_0            (0x1u<<16)
#define HPDMA_C14BR2_BRSAO              (0xFFFFu<<0)
#define HPDMA_C14BR2_BRSAO_0            (0x1u<<0)

// C14LLR Configuration

#define HPDMA_C14LLR_UT1                (0x1u<<31)
#define HPDMA_C14LLR_UT2                (0x1u<<30)
#define HPDMA_C14LLR_UB1                (0x1u<<29)
#define HPDMA_C14LLR_USA                (0x1u<<28)
#define HPDMA_C14LLR_UDA                (0x1u<<27)
#define HPDMA_C14LLR_UT3                (0x1u<<26)
#define HPDMA_C14LLR_UB2                (0x1u<<25)
#define HPDMA_C14LLR_ULL                (0x1u<<16)
#define HPDMA_C14LLR_LA                 (0x3FFFu<<2)
#define HPDMA_C14LLR_LA_0               (0x1u<<2)

#define HPDMA_C14LLR_UT1_B_0X0          (0x0u<<31)
#define HPDMA_C14LLR_UT1_B_0X1          (0x1u<<31)
#define HPDMA_C14LLR_UT2_B_0X0          (0x0u<<30)
#define HPDMA_C14LLR_UT2_B_0X1          (0x1u<<30)
#define HPDMA_C14LLR_UB1_B_0X0          (0x0u<<29)
#define HPDMA_C14LLR_UB1_B_0X1          (0x1u<<29)
#define HPDMA_C14LLR_USA_B_0X0          (0x0u<<28)
#define HPDMA_C14LLR_USA_B_0X1          (0x1u<<28)
#define HPDMA_C14LLR_UDA_B_0X0          (0x0u<<27)
#define HPDMA_C14LLR_UDA_B_0X1          (0x1u<<27)
#define HPDMA_C14LLR_UT3_B_0X0          (0x0u<<26)
#define HPDMA_C14LLR_UT3_B_0X1          (0x1u<<26)
#define HPDMA_C14LLR_UB2_B_0X0          (0x0u<<25)
#define HPDMA_C14LLR_UB2_B_0X1          (0x1u<<25)
#define HPDMA_C14LLR_ULL_B_0X0          (0x0u<<16)
#define HPDMA_C14LLR_ULL_B_0X1          (0x1u<<16)

// C15LBAR Configuration

#define HPDMA_C15LBAR_LBA               (0xFFFFu<<16)
#define HPDMA_C15LBAR_LBA_0             (0x1u<<16)

// C15FCR Configuration

#define HPDMA_C15FCR_TOF                (0x1u<<14)
#define HPDMA_C15FCR_SUSPF              (0x1u<<13)
#define HPDMA_C15FCR_USEF               (0x1u<<12)
#define HPDMA_C15FCR_ULEF               (0x1u<<11)
#define HPDMA_C15FCR_DTEF               (0x1u<<10)
#define HPDMA_C15FCR_HTF                (0x1u<<9)
#define HPDMA_C15FCR_TCF                (0x1u<<8)

#define HPDMA_C15FCR_TOF_B_0X0          (0x0u<<14)
#define HPDMA_C15FCR_TOF_B_0X1          (0x1u<<14)
#define HPDMA_C15FCR_SUSPF_B_0X0        (0x0u<<13)
#define HPDMA_C15FCR_SUSPF_B_0X1        (0x1u<<13)
#define HPDMA_C15FCR_USEF_B_0X0         (0x0u<<12)
#define HPDMA_C15FCR_USEF_B_0X1         (0x1u<<12)
#define HPDMA_C15FCR_ULEF_B_0X0         (0x0u<<11)
#define HPDMA_C15FCR_ULEF_B_0X1         (0x1u<<11)
#define HPDMA_C15FCR_DTEF_B_0X0         (0x0u<<10)
#define HPDMA_C15FCR_DTEF_B_0X1         (0x1u<<10)
#define HPDMA_C15FCR_HTF_B_0X0          (0x0u<<9)
#define HPDMA_C15FCR_HTF_B_0X1          (0x1u<<9)
#define HPDMA_C15FCR_TCF_B_0X0          (0x0u<<8)
#define HPDMA_C15FCR_TCF_B_0X1          (0x1u<<8)

